In [1]:
import pandas as pd
# Create dictionary of test scores
test_dict = {'Scotty':[63,75,88], 'Joy':[48,98,92], 'Kamala': [87, 86, 85]}
# Create DataFrame
df = pd.DataFrame(test_dict)

In [2]:
# Limit DataFrame to first 2 rows
df[0:2]

   Scotty  Joy  Kamala
0      63   48      87
1      75   98      86

In [3]:
df = df.T
df

         0   1   2
Scotty  63  75  88
Joy     48  98  92
Kamala  87  86  85

In [4]:
# Rename Columns
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3']
df

        Quiz_1  Quiz_2  Quiz_3
Scotty      63      75      88
Joy         48      98      92
Kamala      87      86      85

In [5]:
# Define new DataFrame - first 2 rows, last 2 columns 
rows = ['Scotty', 'Joy']
cols = ['Quiz_2', 'Quiz_3']
df_spring = df.loc[rows, cols]
df_spring

        Quiz_2  Quiz_3
Scotty      75      88
Joy         98      92

In [6]:
# Select first 2 rows and last 2 columns using index numbers 
df.iloc[[0,1], [1,2]]

        Quiz_2  Quiz_3
Scotty      75      88
Joy         98      92

In [7]:
# Select first 2 rows and last 2 columns using index numbers 
df.iloc[0:2, 1:3]

        Quiz_2  Quiz_3
Scotty      75      88
Joy         98      92

In [8]:
# Define new column as mean of other columns
df['Quiz_Avg'] = df.mean(axis=1)
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg
Scotty      63      75      88  75.333333
Joy         48      98      92  79.333333
Kamala      87      86      85  86.000000

In [9]:
df['Quiz_4'] = [92, 95, 88]
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg  Quiz_4
Scotty      63      75      88  75.333333      92
Joy         48      98      92  79.333333      95
Kamala      87      86      85  86.000000      88

In [10]:
del df['Quiz_Avg']
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Scotty      63      75      88      92
Joy         48      98      92      95
Kamala      87      86      85      88

In [12]:
import numpy as np
type(np.NaN)

float

In [13]:
np.NaN

nan